import os
import pytest
import requests
from dotenv import load_dotenv

load_dotenv()
DEFAULT_TIMEOUT: int = 15


def _get_env(name: str) -> str:
    """Беру переменную из окружения и если её нет - падает с понятной ошибкой"""
    value = os.getenv(name)
    assert value, f" Переменная {name} не задана в .env"
    return value


@pytest.fixture(scope="session")
def base_url() -> str:
    return _get_env("BASE_URL")


@pytest.fixture(scope="session")
def api_token() -> str:
    return _get_env("API_TOKEN")


@pytest.fixture(scope="session")
def http_session(api_token: str) -> requests.Session:
    session = requests.Session()
    session.headers.update(
        {
            "app-id": api_token,
            "Accept": "application/json",  # проверь в документации нужно ли
            "Content-Type": "application/json"  # проверь в документации нужно ли
        }
    )
    yield session
    session.close()

# ========================================================USER==========================================================
# ======================================================================================================================
# ========================================================USER==========================================================


# ========================================================POST==========================================================
# ======================================================================================================================
# ========================================================POST==========================================================


# ======================================================COMMENT=========================================================
# ======================================================================================================================
# ======================================================COMMENT=========================================================
